package constants

const (
	MessageE0001 = "パラメータが不正です。"
	MessageE0002 = "ユーザマスタに存在しません。"
	MessageE0003 = "アプリトークンが不正です。"
	MessageE0004 = "アクセストークンが不正です。"

	MessageE1001 = "アクセスが拒否されました。"

	MessageE2001 = "キャラクターデータが存在しません。"

	MessageE4001 = "ユーザの追加に失敗しました。"
	MessageE4002 = "アクセストークンの追加に失敗しました。"
	MessageE4003 = "キャラクターデータの追加に失敗しました。"
	MessageE4004 = "位置情報の取得に失敗しました。"
	MessageE4005 = "位置情報の追加に失敗しました。"
	MessageE4006 = "プロフィールの追加に失敗しました。"
	MessageE4007 = "セーブデータの追加に失敗しました。"
	MessageE4008 = "アイテム交換の更新に失敗しました。"
	MessageE4009 = "アイテム交換の追加に失敗しました。"
)
